// ------------------------------------------------------
// Date
// ------------------------------------------------------

// const NOW = new Date(); //Thu May 04 2023 10:35:40 GMT+0900 (한국 표준시)
// const NOW = new Date('2023-04-30 15:20:30.123'); 

// ------------------------------------------------------
// 1.getFullYear() : 연도만 가져오는 메소드
// ------------------------------------------------------
// console.log( "연도 : " + NOW.getFullYear() ); // 2023

// ------------------------------------------------------
// 2.getMonth() : 월만 가져오는 메소드 ( 0부터 11을 가져옴. +1 해줘야 현재 월과 같아짐 )
// ------------------------------------------------------
// console.log( "월 : " + (NOW.getMonth() + 1 ) ); // 5

// ------------------------------------------------------
// 3.getDate() : 날짜를 가져오는 메소드
// ------------------------------------------------------
// console.log( "일 : " + (NOW.getDate()) ); // 4

// ------------------------------------------------------
// 4.getDay() : 요일을 가져오는 메소드 ( 일요일 = 0 ~ 토요일 = 6 )
// ------------------------------------------------------
// console.log( "요일 : " + NOW.getDay() ); // 4

// ------------------------------------------------------
// 5.getTime() : 1970/01/01 기준으로 몇초가 지났는지 초를 가져온다
// ------------------------------------------------------
// console.log( "시간(Linux) : " + NOW.getTime() );

// ------------------------------------------------------
// 6.getHours() : 시간을 가져오는 메소드
// ------------------------------------------------------
// console.log( "시 : " + NOW.getHours() );

// ------------------------------------------------------
// 7.getMinutes() : 분을 가져오는 메소드
// ------------------------------------------------------
// console.log( "분 : " + NOW.getMinutes() );

// ------------------------------------------------------
// 8.getSeconds() : 초를 가져오는 메소드
// ------------------------------------------------------
// console.log( "초 : " + NOW.getSeconds() );

// ------------------------------------------------------
// 9.getMilliseconds() : 밀리초를 가져오는 메소드
// ------------------------------------------------------
// console.log( "밀리초 : " + NOW.getMilliseconds() ); 

// 연습문제
// 기준일 : 2022년 9월 30일 19시 20분 10초 
// 오늘 부터 몇일 전인지 출력해주세요.

const today = new Date();
const dday = new Date( '2022-09-30 19:20:10' );

let to_date = today.getTime();
let from_date = dday.getTime();

let d_times = to_date - from_date;
let d_days = d_times / (1000*60*60*24); 
let result = Math.ceil(d_days);

console.log(result + "일 남았습니다.");

