<?php

    print "안녕하세요.\n"; // \n 줄바꿈 
    print ("안녕하세요. 괄호입니다.\n"); // return값이 있다

    echo "안녕하세요. 에코입니다.\n"; // return값이 없다 협업에서 많이사용

    $test_num = 1; // 변수선언 : $변수명 = 값;

    echo $test_num;
/* 
    변수 : 데이터를 저장하는 장소
    변수이름 규칙
        1.변수는 '$'문자로 시작한다.
        2.변수의 이름은 영문 대문자, 소문자, 숫자, '_' 로 이루어진다.
        3.'$'다음의 첫글자는 숫자를 사용할 수 없다.
    네이밍기법
        1.카멜 기법 : 낙타의 등을 연상하고, 단어의 첫글자는 대문자, 나머지는 소문자로 작성 하는 기법
            ex)$TestNum
        2.스네이크 기법 : 뱀을 연상하고, 단어와 단어 사이를 "_"로 이어주고 전부 소문자로 작성 하는 기법
            ex)$test_num
 */

?>